//Напишите программу, которая на вход
//принимает два целых числа и проверяет,
//является ли первое число квадратом второго.

//Например:
// 4 = > 16
// -3 = > 9
// -7 = > 49


int num=Convert.ToInt32((Console.ReadLine()));

int result= num*num;
Console.WriteLine(result);